Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.Insert Method
 Inserts an element in the collection at a specified index.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Insert(
	int Index,
	BinaryFilterExpressionItem Item
)
Public Sub Insert (
	Index As Integer,
	Item As BinaryFilterExpressionItem
)
Parameters
Index
Type: System.Int32
The zero-based index at which the item shoud be inserted.
Item
Type: Tekla.Structures.Filtering.BinaryFilterExpressionItem
The item to insert. This value cannot be null.
Implements
IList<T>.Insert(Int32, T)
Exceptions
Exception | Condition
ArgumentNullException | Thrown when the supplied item is null.
ArgumentException | Thrown when the supplied index is out of bounds.
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace